print("----------------------------欢迎来到男人的衣柜海澜之家------------------------")
print("=========================================================================")
print("名称              码数              价格             品质                数量")
print("--------------------------------------------------------------------------")
print("外套               L               300               A                 200")
print("衬衣               L               200               A                 300")
print("西装               L               1000              A                 200")
print("短袖               L               100               A                 500")
print("短裤               L               100               A                 500")
print("羽绒服             XL              2000               A                300")
print("领带              均码              500               A                 200")
print("--------------------------------------------------------------------------")
#print("总金额为:",(300*200+200*300+1000*200+100*500+100*500+2000*300+500*200),"￥")

coat=300
shirt=200
garments=1000
trad=100
short=100
camlet=2000
tie=500
num1=200
num2=300
num3=200
num4=500
num5=500
num6=300
num7=200
total=(coat*num1+shirt*num2+garments*num3+trad*num4+short*num5+camlet*num6+tie*num7)
print("总金额为：",(total),"￥")